--------------------这个放第一个代码文件里-------------------
function _init()
  cls()
  -----------------------------例子-------------------------------
  --TODO:--创建对象---(对象名, 精灵编号, 创建的位置_x, 创建的位置_y, 精灵宽度, 精灵高度, 是否具有物理规则)
  player = init_spr("player", 1, 50, 50, 1, 1, true)
  --TODO:--创建动画第一个---(对象, 第一帧精灵编号, 最后一帧精灵编号, 动画名称, 是否循环)
  init_animation(player, 1, 3, 10, "nomal", false)
  --TODO:--创建动画第二个---(对象, 第一帧精灵编号, 最后一帧精灵编号, 动画名称, 是否循环)
  init_animation(player, 4, 6, 10, "go", true)
  ----------------------------------------------------------------
end

function _update()
  ---------------里面不用管------------------
  game_states.update_states["play_update"]()
  ------------------------------------------

  ------------------------举例------------------------
  -----------动画默认播放的是第一个创建的动画------------
  --TODO:--切换动画----(动画所在的对象，欲切换的动画名称)
  if (btnp(L)) change_animation(player, "go")

end

function _draw()
  cls()
  ---------------里面不用管------------------
  game_states.draw_states["play_draw"]()
  ------------------------------------------
end
